packages/StoveOpt/StoveOpt-0.3.2-py2-none-any.whl/StoveOpt/foamfiles/counterFlowFlame2D/system/Obselete/blockMeshDict_workingcopy.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0.0 0.0 0.01)
	(0.1 0.0 0.01)
	(0.0 0.15 0.01)
	(0.1 0.15 0.01)
	(0.1 0.16 0.01)
	(0.0 0.16 0.01)
	(0.0 0.3 0.01)
	(0.1 0.3 0.01)
	(0.17 0.3 0.01)
	(-0.07 0.3 0.01)
	(-0.07 0.5 0.01)
	(-0.04 0.5 0.01)
	(0.14 0.5 0.01)
	(0.17 0.5 0.01)
	(-0.04 0.33 0.01)
	(0.14 0.33 0.01)
	(0.025 0.076 0.01)
	(0.075 0.076 0.01)
	(0.075 0.152 0.01)
	(0.025 0.152 0.01)
	(0.0 0.33 0.01)
	(0.1 0.33 0.01)                                                                       
	(0.0 0.0 -0.01)
	(0.1 0.0 -0.01)
	(0.0 0.15 -0.01)
	(0.1 0.15 -0.01)
	(0.1 0.16 -0.01)
	(0.0 0.16 -0.01)
	(0.0 0.3 -0.01)
	(0.1 0.3 -0.01)
	(0.17 0.3 -0.01)
	(-0.07 0.3 -0.01)
	(-0.07 0.5 -0.01)
	(-0.04 0.5 -0.01)
	(0.14 0.5 -0.01)
	(0.17 0.5 -0.01)
	(-0.04 0.33 -0.01)
	(0.14 0.33 -0.01)
	(0.025 0.076 -0.01)
	(0.075 0.076 -0.01)
	(0.075 0.152 -0.01)
	(0.025 0.152 -0.01)
	(0.0 0.33 -0.01)
	(0.1 0.33 -0.01)  
(                                                                                                                                    
);

blocks
(
);

edges
(
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
			
        );
    }
    primary_air
    {
        type patch;
        faces
        (
			
        );
    }
    secondary_air_RHS
    {
		type patch;
		faces
			(
				
			);
    }
    secondary_air_LHS
    {
		type patch;
		faces
			(
				
			);
    }
    outlet
    {
        type patch;
        faces
        (
			
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (	
			
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
